Examinator/src/InformationRegisters/ВыбранныеВариантыОтветовВопросовСУЗ/ВыбранныеВариантыОтветовВопросовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыбранныеВариантыОтветовВопросовСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Выбран</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерныйВыбран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерныйНеВыбран</name>
    <comment>Равно Истина, если вариант верный, но не был выбран пользователем.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибочныйВыбран</name>
    <comment>Равно Истина, если вариант является дистрактором и был выбран.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибочныйНеВыбран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <dimensions>
    <name>СессияВыполненияТеста</name>
    <type>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
      <types>DocumentRef.ПопыткаВыполненияПодборкиВопросовСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВариантОтвета</name>
    <type>
      <types>CatalogRef.ВариантыОтветовНаВопросСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВопросыСУЗ/ДанныеВопросыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВопросыСУЗ</name>
  <resources>
    <name>ТекстовыеДанные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ВерныйКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОшибочныйКомментарий</name>
    <comment>Используется для вариантов ответов</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДанных</name>
    <type>
      <types>CatalogRef.ВариантыОтветовНаВопросСУЗ</types>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВыбранныеВариантыОтветовВопросовСУЗ/ManagerModule.bsl
Функция ВыбранныеВарианты(СессииВыполненияТеста, Вопросы) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыбранныеВариантыОтветовВопросовСУЗ.Регистратор КАК ОтветНаВопрос,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.СессияВыполненияТеста,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.Вопрос КАК Вопрос,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.ВариантОтвета,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.Выбран,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.ВерныйВыбран,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.ВерныйНеВыбран,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.ОшибочныйВыбран,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.ОшибочныйНеВыбран,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.Номер КАК Номер,
		|	ДанныеВопросыСУЗ.ТекстовыеДанные КАК ТекстВарианта,
		|	ВыбранныеВариантыОтветовВопросовСУЗ.ВариантОтвета.Верный КАК Верный
		|ИЗ
		|	РегистрСведений.ВыбранныеВариантыОтветовВопросовСУЗ КАК ВыбранныеВариантыОтветовВопросовСУЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеВопросыСУЗ КАК ДанныеВопросыСУЗ
		|		ПО ВыбранныеВариантыОтветовВопросовСУЗ.Вопрос = ДанныеВопросыСУЗ.СсылкаНаОбъектСУЗ
		|			И ВыбранныеВариантыОтветовВопросовСУЗ.Вопрос.Поставщик = ДанныеВопросыСУЗ.Поставщик
		|			И ВыбранныеВариантыОтветовВопросовСУЗ.Вопрос.Версия = ДанныеВопросыСУЗ.Версия
		|			И ВыбранныеВариантыОтветовВопросовСУЗ.ВариантОтвета = ДанныеВопросыСУЗ.КодДанных
		|ГДЕ
		|	ВыбранныеВариантыОтветовВопросовСУЗ.СессияВыполненияТеста В(&СессииВыполненияТеста)
		|	И ВыбранныеВариантыОтветовВопросовСУЗ.Вопрос В(&Вопросы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вопрос,
		|	Номер";
	
	Запрос.УстановитьПараметр("Вопросы", Вопросы);
	Запрос.УстановитьПараметр("СессииВыполненияТеста", СессииВыполненияТеста);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции
